{
  "TotalCount": 0,
  "PageSize": 5,
  "CurrentPage": 0,
  "TotalPages": 2,
  "Items": [
    {
      "id": "0",
      "TrainingName": "JavaScript",
      "TrainingIcon": "svg",
      "TrainingDescription": "JavaScript é uma linguagem de programação de alto nível, interpretada e orientada a objetos. Ela é amplamente utilizada para criar interatividade em páginas web, mas também é aplicada em ambientes fora dos navegadores.",
      "Duration": "175 horas",
      "GroupsId": ["0", "2"]
    },
    {
      "id": "1",
      "TrainingName": "MongoDB",
      "TrainingIcon": "svg",
      "TrainingDescription": "O MongoDB é um banco de dados NoSQL, o que significa que não utiliza o modelo de tabelas relacionadas, comumente encontrado em bancos de dados relacionais como o MySQL ou o PostgreSQL. Em vez disso, o MongoDB é um banco de dados orientado a documentos, onde os dados são armazenados em documentos no formato JSON-like (BSON, que é uma representação binária do JSON).",
      "Duration": "80 horas",
      "GroupsId": ["1"]
    },
    {
      "id": "2",
      "TrainingName": "C#",
      "TrainingIcon": "svgZ",
      "TrainingDescription": "C# (pronuncia-se 'C Sharp') é uma linguagem de programação moderna e orientada a objetos desenvolvida pela Microsoft. ",
      "Duration": "164 horas",
      "GroupsId": ["1", "2"]
    },
    {
      "id": "3",
      "TrainingName": "Python",
      "TrainingIcon": "svg",
      "TrainingDescription": "Python é uma linguagem de programação de alto nível, interpretada e de propósito geral.",
      "Duration": "110 horas",
      "GroupsId": ["1", "2"]
    },
    {
      "id": "4",
      "TrainingName": "PostgreSQL",
      "TrainingIcon": "svg",
      "TrainingDescription": "PostgreSQL é um sistema de gerenciamento de banco de dados relacional de código aberto, conhecido por sua confiabilidade e recursos avançados.",
      "Duration": "60 horas",
      "GroupsId": ["1"]
    },
    {
      "id": "5",
      "TrainingName": "Flutter",
      "TrainingIcon": "svg",
      "TrainingDescription": "Flutter é um framework de interface do usuário (UI) de código aberto, desenvolvido pela Google, que permite a criação de aplicativos nativos para dispositivos móveis, web e desktop a partir de um único código-fonte. Ele usa a linguagem de programação Dart.",
      "Duration": "211 horas",
      "GroupsId": ["5"]
    }
  ]
}
